app/controllers/produtos_controller.rb

    def index
        @produtos_por_nome = Produto.order(:nome)
        @produtos_por_preco = Produto.order(:preco)
---
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC

    def create
	    valores = params.require(:produto).permit :nome, :preco, :descricao, :quantidade
	    produto = Produto.create valores
---
INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "CAmisa azul"], ["descricao", "teste camisA azul"], ["quantidade", 2], ["preco", 30.0], ["created_at", "2017-10-14 02:42:03.673399"], ["updated_at", "2017-10-14 02:42:03.673399"]]